gen_model
Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 64, 64, 64)   4864        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 64, 64, 64)   256         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 128)  73856       batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 128)  512         conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 16, 256)  295168      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 16, 16, 256)  1024        conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 8, 8, 512)    1180160     batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 8, 8, 512)    2048        conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 4, 4, 512)    2359808     batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 4, 4, 512)    2048        conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 2, 2, 512)    2359808     batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 2, 2, 512)    2048        conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 4, 4, 512)    2359808     batch_normalization_5[0][0]      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 4, 4, 512)    2048        conv2d_transpose[0][0]           
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 4, 4, 1024)   0           batch_normalization_6[0][0]      
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 8, 8, 512)    4719104     concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 8, 8, 512)    2048        conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8, 8, 1024)   0           batch_normalization_7[0][0]      
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 16, 16, 512)  4719104     concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 512)  2048        conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 16, 16, 768)  0           batch_normalization_8[0][0]      
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 32, 32, 256)  1769728     concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 32, 256)  1024        conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 32, 32, 384)  0           batch_normalization_9[0][0]      
                                                                 batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 64, 64, 128)  442496      concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64, 64, 128)  512         conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 64, 64, 192)  0           batch_normalization_10[0][0]     
                                                                 batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 128, 128, 64) 110656      concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 128, 128, 64) 256         conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 128, 128, 67) 0           batch_normalization_11[0][0]     
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 64) 107264      concatenate_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 128, 128, 64) 256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 3)  4803        batch_normalization_12[0][0]     
==================================================================================================
Total params: 20,522,755
Trainable params: 20,514,691
Non-trainable params: 8,064
__________________________________________________________________________________________________

dis_model
Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
x (InputLayer)                  [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
y (InputLayer)                  [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 64)   4864        x[0][0]                          
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 64)   4864        y[0][0]                          
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 64, 64, 64)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 64, 64, 64)   0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 128)  73856       leaky_re_lu[0][0]                
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 128)  73856       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 32, 128)  512         conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 32, 128)  512         conv2d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 32, 32, 128)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 32, 32, 128)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 32, 32, 256)  0           leaky_re_lu_2[0][0]              
                                                                 leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32, 32, 256)  0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 512)  1180160     dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 16, 16, 512)  2048        conv2d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 16, 16, 512)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 512)  2359808     leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 16, 16, 512)  2048        conv2d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 16, 16, 512)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 1)    4609        leaky_re_lu_5[0][0]              
==================================================================================================
Total params: 3,707,137
Trainable params: 3,704,577
Non-trainable params: 2,560
__________________________________________________________________________________________________

