model
Model: "functional_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
functional_7 (Functional)    (None, 64)                1685184   
_________________________________________________________________
functional_9 (Functional)    (None, 32, 32, 3)         4050883   
=================================================================
Total params: 5,736,067
Trainable params: 5,728,003
Non-trainable params: 8,064
_________________________________________________________________

encoder_model
Model: "functional_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 64)        1728      
_________________________________________________________________
batch_normalization_10 (Batc (None, 16, 16, 64)        256       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 128)         73728     
_________________________________________________________________
batch_normalization_11 (Batc (None, 8, 8, 128)         512       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 4, 4, 256)         294912    
_________________________________________________________________
batch_normalization_12 (Batc (None, 4, 4, 256)         1024      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 2, 2, 512)         1179648   
_________________________________________________________________
batch_normalization_13 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                131072    
_________________________________________________________________
batch_normalization_14 (Batc (None, 64)                256       
=================================================================
Total params: 1,685,184
Trainable params: 1,683,136
Non-trainable params: 2,048
_________________________________________________________________

decoder_model
Model: "functional_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 64)]              0         
_________________________________________________________________
dense_3 (Dense)              (None, 2048)              131072    
_________________________________________________________________
batch_normalization_15 (Batc (None, 2048)              8192      
_________________________________________________________________
reshape_1 (Reshape)          (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 4, 4, 512)         2359296   
_________________________________________________________________
batch_normalization_16 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 8, 8, 256)         1179648   
_________________________________________________________________
batch_normalization_17 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 16, 16, 128)       294912    
_________________________________________________________________
batch_normalization_18 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 32, 32, 64)        73728     
_________________________________________________________________
batch_normalization_19 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 32, 32, 3)         195       
=================================================================
Total params: 4,050,883
Trainable params: 4,044,867
Non-trainable params: 6,016
_________________________________________________________________

