model
Model: "functional_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 64, 64, 3)]       0         
_________________________________________________________________
functional_1 (Functional)    (None, 2, 2, 1024)        6276544   
_________________________________________________________________
functional_3 (Functional)    (None, 64, 64, 3)         15712204  
=================================================================
Total params: 21,988,748
Trainable params: 21,980,806
Non-trainable params: 7,942
_________________________________________________________________

encoder_model
Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 64, 64, 3)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 32, 32, 64)        1728      
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 64)        256       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 16, 128)       73728     
_________________________________________________________________
batch_normalization_1 (Batch (None, 16, 16, 128)       512       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 256)         294912    
_________________________________________________________________
batch_normalization_2 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 512)         1179648   
_________________________________________________________________
batch_normalization_3 (Batch (None, 4, 4, 512)         2048      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 2, 2, 1024)        4718592   
_________________________________________________________________
batch_normalization_4 (Batch (None, 2, 2, 1024)        4096      
=================================================================
Total params: 6,276,544
Trainable params: 6,272,576
Non-trainable params: 3,968
_________________________________________________________________

decoder_model
Model: "functional_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 2, 2, 1024)]      0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 4, 4, 1024)        9437184   
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 4, 1024)        4096      
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 8, 8, 512)         4718592   
_________________________________________________________________
batch_normalization_6 (Batch (None, 8, 8, 512)         2048      
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 16, 16, 256)       1179648   
_________________________________________________________________
batch_normalization_7 (Batch (None, 16, 16, 256)       1024      
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 32, 32, 128)       294912    
_________________________________________________________________
batch_normalization_8 (Batch (None, 32, 32, 128)       512       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 64, 64, 64)        73728     
_________________________________________________________________
batch_normalization_9 (Batch (None, 64, 64, 64)        256       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 64, 3)         192       
_________________________________________________________________
batch_normalization_10 (Batc (None, 64, 64, 3)         12        
=================================================================
Total params: 15,712,204
Trainable params: 15,708,230
Non-trainable params: 3,974
_________________________________________________________________

decoder_model2
Model: "functional_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 2, 2, 1024)]      0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 4, 4, 1024)        9437184   
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 4, 1024)        4096      
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 8, 8, 512)         4718592   
_________________________________________________________________
batch_normalization_6 (Batch (None, 8, 8, 512)         2048      
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 16, 16, 256)       1179648   
_________________________________________________________________
batch_normalization_7 (Batch (None, 16, 16, 256)       1024      
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 32, 32, 128)       294912    
_________________________________________________________________
batch_normalization_8 (Batch (None, 32, 32, 128)       512       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 64, 64, 64)        73728     
_________________________________________________________________
batch_normalization_9 (Batch (None, 64, 64, 64)        256       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 64, 3)         192       
_________________________________________________________________
batch_normalization_10 (Batc (None, 64, 64, 3)         12        
=================================================================
Total params: 15,712,204
Trainable params: 15,708,230
Non-trainable params: 3,974
_________________________________________________________________

