model
Model: "functional_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
functional_1 (Functional)       [(None, 6), (None, 6 1578444     input_3[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_Shape (TensorFlowOp [(2,)]               0           functional_1[0][0]               
__________________________________________________________________________________________________
tf_op_layer_RandomStandardNorma [(None, 6)]          0           tf_op_layer_Shape[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Mul (TensorFlowOpLa [(None, 6)]          0           tf_op_layer_RandomStandardNormal[
__________________________________________________________________________________________________
tf_op_layer_Mul_1 (TensorFlowOp [(None, 6)]          0           functional_1[0][1]               
__________________________________________________________________________________________________
tf_op_layer_Add (TensorFlowOpLa [(None, 6)]          0           tf_op_layer_Mul[0][0]            
__________________________________________________________________________________________________
tf_op_layer_Exp (TensorFlowOpLa [(None, 6)]          0           tf_op_layer_Mul_1[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Mul_2 (TensorFlowOp [(None, 6)]          0           tf_op_layer_Add[0][0]            
                                                                 tf_op_layer_Exp[0][0]            
__________________________________________________________________________________________________
tf_op_layer_AddV2 (TensorFlowOp [(None, 6)]          0           tf_op_layer_Mul_2[0][0]          
                                                                 functional_1[0][0]               
__________________________________________________________________________________________________
functional_3 (Functional)       (None, 32, 32, 3)    3932099     tf_op_layer_AddV2[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Sigmoid (TensorFlow [(None, 32, 32, 3)]  0           functional_3[0][0]               
==================================================================================================
Total params: 5,510,543
Trainable params: 5,502,607
Non-trainable params: 7,936
__________________________________________________________________________________________________

encoder_model
Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 16, 16, 64)   1728        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 16, 16, 64)   256         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 8, 8, 128)    73728       batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 8, 8, 128)    512         conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 4, 4, 256)    294912      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 4, 4, 256)    1024        conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 2, 2, 512)    1179648     batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 2, 2, 512)    2048        conv2d_3[0][0]                   
__________________________________________________________________________________________________
flatten (Flatten)               (None, 2048)         0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 6)            12294       flatten[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 6)            12294       flatten[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 6)            0           dense_1[0][0]                    
==================================================================================================
Total params: 1,578,444
Trainable params: 1,576,524
Non-trainable params: 1,920
__________________________________________________________________________________________________

decoder_model
Model: "functional_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 6)]               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              12288     
_________________________________________________________________
batch_normalization_4 (Batch (None, 2048)              8192      
_________________________________________________________________
reshape (Reshape)            (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 4, 4, 512)         2359296   
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 4, 512)         2048      
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 8, 8, 256)         1179648   
_________________________________________________________________
batch_normalization_6 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 16, 16, 128)       294912    
_________________________________________________________________
batch_normalization_7 (Batch (None, 16, 16, 128)       512       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 32, 32, 64)        73728     
_________________________________________________________________
batch_normalization_8 (Batch (None, 32, 32, 64)        256       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 3)         195       
=================================================================
Total params: 3,932,099
Trainable params: 3,926,083
Non-trainable params: 6,016
_________________________________________________________________

