model
Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 16, 64)   1728        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 16, 16, 64)   256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 16, 96)   6144        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 16)   1024        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 96)   384         conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 16, 16, 16)   64          conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 128)  110592      batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   12800       batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 64)   4096        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16, 16, 128)  512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 32)   128         conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 64)   256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 224)  0           batch_normalization_6[0][0]      
                                                                 batch_normalization_8[0][0]      
                                                                 batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 96)   21504       concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 16)   3584        concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 96)   384         conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 16)   64          conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 128)  110592      batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 32)   12800       batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 64)   14336       concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 128)  512         conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 32)   128         conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 16, 64)   256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 16, 16, 224)  0           batch_normalization_11[0][0]     
                                                                 batch_normalization_13[0][0]     
                                                                 batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 16, 16, 96)   21504       concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 16, 16, 16)   3584        concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 16, 16, 96)   384         conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 16, 16, 16)   64          conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 256)    221184      batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 8, 8, 64)     25600       batch_normalization_17[0][0]     
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 256)    1024        conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 64)     256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 8, 8, 224)    0           concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 8, 8, 544)    0           batch_normalization_16[0][0]     
                                                                 batch_normalization_18[0][0]     
                                                                 max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 128)    69632       concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 32)     17408       concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 128)    512         conv2d_19[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 8, 8, 32)     128         conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 8, 8, 196)    225792      batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 8, 8, 64)     51200       batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 8, 8, 128)    69632       concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 8, 8, 196)    784         conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 8, 8, 64)     256         conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 8, 8, 128)    512         conv2d_23[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8, 8, 388)    0           batch_normalization_20[0][0]     
                                                                 batch_normalization_22[0][0]     
                                                                 batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 8, 8, 128)    49664       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 8, 8, 32)     12416       concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 8, 8, 128)    512         conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 8, 8, 32)     128         conv2d_26[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 8, 8, 196)    225792      batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 8, 8, 64)     51200       batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 8, 8, 128)    49664       concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 8, 8, 196)    784         conv2d_25[0][0]                  
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 8, 8, 64)     256         conv2d_27[0][0]                  
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 8, 8, 128)    512         conv2d_28[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 8, 8, 388)    0           batch_normalization_25[0][0]     
                                                                 batch_normalization_27[0][0]     
                                                                 batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 8, 8, 196)    76048       concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 8, 8, 32)     12416       concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 8, 8, 196)    784         conv2d_29[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 8, 8, 32)     128         conv2d_31[0][0]                  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 4, 4, 320)    564480      batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 4, 4, 64)     51200       batch_normalization_31[0][0]     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 4, 4, 320)    1280        conv2d_30[0][0]                  
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 4, 4, 64)     256         conv2d_32[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 4, 4, 388)    0           concatenate_4[0][0]              
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 4, 4, 772)    0           batch_normalization_30[0][0]     
                                                                 batch_normalization_32[0][0]     
                                                                 max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 4, 4, 196)    151312      concatenate_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 4, 4, 196)    784         conv2d_33[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 4, 4, 256)    451584      batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 4, 4, 256)    197632      concatenate_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 4, 4, 256)    1024        conv2d_34[0][0]                  
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 4, 4, 256)    1024        conv2d_35[0][0]                  
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 4, 4, 512)    0           batch_normalization_34[0][0]     
                                                                 batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 4, 4, 196)    100352      concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 4, 4, 196)    784         conv2d_36[0][0]                  
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 4, 4, 256)    451584      batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 4, 4, 256)    131072      concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 4, 4, 256)    1024        conv2d_37[0][0]                  
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 4, 4, 256)    1024        conv2d_38[0][0]                  
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 4, 4, 512)    0           batch_normalization_37[0][0]     
                                                                 batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 4, 4, 228)    116736      concatenate_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 4, 4, 228)    912         conv2d_39[0][0]                  
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 2, 2, 320)    656640      batch_normalization_39[0][0]     
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 2, 2, 320)    1280        conv2d_40[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 2, 2, 512)    0           concatenate_7[0][0]              
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 2, 2, 832)    0           batch_normalization_40[0][0]     
                                                                 max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 832)          0           concatenate_8[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           8330        global_average_pooling2d[0][0]   
==================================================================================================
Total params: 4,382,218
Trainable params: 4,372,538
Non-trainable params: 9,680
__________________________________________________________________________________________________

