gen_model
Model: "functional_13"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
condition (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
embedding_6 (Embedding)         (None, 1, 100)       1000        condition[0][0]                  
__________________________________________________________________________________________________
noise (InputLayer)              [(None, 100)]        0                                            
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1, 1568)      156800      embedding_6[0][0]                
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 10976)        1097600     noise[0][0]                      
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 1, 1568)      6272        dense_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 10976)        43904       dense_13[0][0]                   
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 7, 7, 32)     0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
reshape_10 (Reshape)            (None, 7, 7, 224)    0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 7, 7, 256)    0           reshape_9[0][0]                  
                                                                 reshape_10[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 14, 14, 128)  294912      concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 14, 14, 128)  512         conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 28, 28, 64)   73728       batch_normalization_26[0][0]     
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 28, 28, 64)   256         conv2d_transpose_7[0][0]         
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 28, 28, 1)    65          batch_normalization_27[0][0]     
==================================================================================================
Total params: 1,675,049
Trainable params: 1,649,577
Non-trainable params: 25,472
__________________________________________________________________________________________________

dis_model
Model: "functional_15"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
condition (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
embedding_7 (Embedding)         (None, 1, 100)       1000        condition[0][0]                  
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1, 784)       78400       embedding_7[0][0]                
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 1, 784)       3136        dense_14[0][0]                   
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 28, 28, 1)    0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
y (InputLayer)                  [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 28, 28, 2)    0           reshape_11[0][0]                 
                                                                 y[0][0]                          
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 14, 14, 32)   608         concatenate_7[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 14, 14, 32)   0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 14, 14, 32)   0           leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 7, 7, 64)     18432       dropout_12[0][0]                 
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 7, 7, 64)     256         conv2d_17[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 7, 7, 64)     0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 7, 7, 64)     0           leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 4, 4, 128)    73728       dropout_13[0][0]                 
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 4, 4, 128)    512         conv2d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 4, 4, 128)    0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 4, 4, 128)    0           leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 2, 2, 256)    294912      dropout_14[0][0]                 
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 2, 2, 256)    1024        conv2d_19[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 2, 2, 256)    0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 2, 2, 256)    0           leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 1024)         0           dropout_15[0][0]                 
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 1)            1025        flatten_3[0][0]                  
==================================================================================================
Total params: 473,033
Trainable params: 470,569
Non-trainable params: 2,464
__________________________________________________________________________________________________

